{"sections":{"main":{"type":"main-page","settings":{"full_width":false}},"7abbca88-bd42-4804-8f4b-396e24f94aec":{"type":"collapsible-tabs","blocks":{"template--17642615996708__7abbca88-bd42-4804-8f4b-396e24f94aec-167446696430cf1e09-0":{"type":"question","settings":{"title":"How many people does a table seat?","answer":"<p>The standard is around 24” per person at a table, but there are some exceptions, for example when working with a smaller space or a banquette. <\/p>"}},"template--17642615996708__7abbca88-bd42-4804-8f4b-396e24f94aec-167446696430cf1e09-1":{"type":"question","settings":{"title":"What type of finish is on my Son of a Woodcutter table?","answer":"<p>For harder woods, like Cherry, Walnut and Hard Maple, we use a finish from Odie's. Odie's combines natural oils and waxes for a silky, natural looking finish. Their finishes are environmentally-friendly and prevent your wood from becoming dry or brittle. They do not require any maintenance, but adding another quick coat in a few years is fast and easy!<\/p><p>For other woods, like Ambrosia Maple, we use a Low-VOC lacquer that offers great protection, a beautiful satin finish and low impact on the environment.<\/p>"}},"ab07df14-ee87-4841-b68b-ce56b9d322e7":{"type":"question","settings":{"title":"Do I need to maintain the finish on my Son of a Woodcutter table?","answer":"<p>No heavy maintenance required here. Just a wipe with a damp cloth and a light dust with some furniture polish (like Pledge) now and then. This will keep your furniture looking great for years to come. Read our guide to caring for your Son of a Woodcutter table.<\/p>"}},"d0b0791e-51fc-4927-9876-70e1da677287":{"type":"question","settings":{"title":"I spilt something on my table! Now what?","answer":"<p>Don’t panic! But wipe it up immediately. Although your table is completely sealed and resistant to spills, you should still use care just as you would with any other wood furniture.<\/p>"}},"eca0188d-8567-4fd0-9d88-a348ad19e305":{"type":"question","settings":{"title":"Does Son of a Woodcutter deliver locally?","answer":"<p>Yes. We deliver locally around the Greater Toronto Area (GTA) and Southwestern Ontario. Delivery costs start at $125 CAD + HST and may vary for considerably large items and boardroom tables. For dining tables, the legs will arrive detached and we will assemble them on site for you.<\/p>"}},"dd7d2980-d429-469e-85a8-03a79a80a264":{"type":"question","settings":{"title":"Can I collect my items directly from the shop?","answer":"<p>You are more than welcome to pick up your items from our shop if you would like to. Once we’ve confirmed that your item is ready for pick-up, you can collect your items during our regular business hours (Mon-Fri 8am-5pm). We’ll help you load your items into your vehicle. Our shop is located at 156642 15th Line, Lakeside, ON.<\/p>"}},"fb52812b-faaf-4025-854f-9887b99d001a":{"type":"question","settings":{"title":"Does Son of a Woodcutter ship across Canada?","answer":"<p>Yes. If you are purchasing larger items like tables, please contact us before purchasing. We do not offer shipping to the US at this time.<\/p>"}},"4f411905-e80a-4f0a-8940-d114e8240a14":{"type":"question","settings":{"title":"Do you offer furniture refinishing?","answer":"<p>We do not offer furniture refinishing. We are happy to build you a table from scratch!<\/p>"}},"69367e71-9d08-4c50-aeeb-4187fdbd04e9":{"type":"question","settings":{"title":"Can you build me a custom bed\/shelf\/banquette\/side table\/credenza?","answer":"<p>At the moment, we only build custom dining tables and desks. Because we are so focused on these items, it allows us to build them really, really well!<\/p>"}},"288f33a9-61b4-4c2e-ab25-a2c035c28552":{"type":"question","settings":{"title":"I’m an interior designer. Can you help me with a table for my client?","answer":"<p>We love working with interior designers to help them find the perfect solutions for their clients! We can work with you to design and build a custom table for your interior design project.<\/p>"}},"473df017-cd0e-44e3-9bdd-baa1b96b1d5d":{"type":"question","settings":{"title":"How long will my order take?","answer":"<p>Lead times are influenced by a number of factors and can vary. Typical lead times can be anywhere between 4 to 12 weeks depending on the project. We will do our best to give you an accurate date when you place your order with us.<\/p>"}},"44c4fde3-7096-4829-90f3-5ad30dd0acc8":{"type":"question","settings":{"title":"Do you take deposits for custom orders?","answer":"<p>Yes. We require a deposit to hold your spot in our queue, and to ensure commitment before we purchase any materials or start the work.<\/p>"}},"9d8c89f3-fe05-458d-9de6-8b15b1933c84":{"type":"question","settings":{"title":"How do you guys stay so handsome?","answer":"<p>Well, this is awkward… now we’re blushing. Youth is on our side, and our skincare routines mostly consist of sawdust. No wonder our tables have that satin sheen!<\/p>"}},"3a141661-ccc0-427f-a948-7e86a12dc79a":{"type":"content","settings":{"content":"<p>HAVE ANOTHER QUESTION?<\/p><p><a href=\"mailto:sales@sonofawoodcutter.ca\" title=\"mailto:sales@sonofawoodcutter.ca\"> Send us an email at sales@sonofawoodcutter.ca<\/a><\/p>"}}},"block_order":["template--17642615996708__7abbca88-bd42-4804-8f4b-396e24f94aec-167446696430cf1e09-0","template--17642615996708__7abbca88-bd42-4804-8f4b-396e24f94aec-167446696430cf1e09-1","ab07df14-ee87-4841-b68b-ce56b9d322e7","d0b0791e-51fc-4927-9876-70e1da677287","eca0188d-8567-4fd0-9d88-a348ad19e305","dd7d2980-d429-469e-85a8-03a79a80a264","fb52812b-faaf-4025-854f-9887b99d001a","4f411905-e80a-4f0a-8940-d114e8240a14","69367e71-9d08-4c50-aeeb-4187fdbd04e9","288f33a9-61b4-4c2e-ab25-a2c035c28552","473df017-cd0e-44e3-9bdd-baa1b96b1d5d","44c4fde3-7096-4829-90f3-5ad30dd0acc8","9d8c89f3-fe05-458d-9de6-8b15b1933c84","3a141661-ccc0-427f-a948-7e86a12dc79a"],"settings":{"title":"Frequently Asked Questions"}}},"order":["main","7abbca88-bd42-4804-8f4b-396e24f94aec"]}